// Тест на EEPROM 24C256, 32768 x 8 (256K)
// 7.07.2019, Arduino IDE v1.8.9, LZ2WSG
//---------------------------------------------------------------------------------------------------------
#include "at24c256.h"
//       _____
//  A0 -|  ^  |- VCC
//  A1 -|     |- WP(GND)
//  NC -|     |- SCL
// GND -|_____|- SDA

// процедури и Функции към EEPROM 24C02:
// eeprom.read(uint8_t m_addr);                    - чете съдържанието на клетка с адрес addr
// eeprom.write(uint8_t m_addr, uint8_t m_data);   - записва клетка на адрес m_addr с данни m_data
// eeprom.update(uint8_t m_addr, uint8_t m_data);  - чете клетка и записва данни само при разлика

at24c256 eeprom(0x50);                             // 0x50 = A1(GND), A0(GND)
//---------------------------------------------------------------------------------------------------------
void setup() {
  Serial.begin(57600);
  eeprom.init();

  eeprom.write(30000, 0xAA);
  Serial.println(eeprom.read(30000), HEX);
}
//---------------------------------------------------------------------------------------------------------
void loop() {
}
